#include <iostream>
#define offset "\t\t\t\t"

void main()
{
	setlocale(LC_ALL, "russian" );
	std::cout << "\t\t\t\t\t\tВ лесу родилась ёлочка,\n\n\
		\t\t\t\tВ лесу она росла,\n\n\
		\t\t\t\tЗимой и летом стройная,\n\n\
	\t\t\t\t\tзеленая была.\n\n\
		\t\t\t\tМетель ей пела песенку :\n\n\
	\t\t\t\t\t«Спи, елочка, бай - бай!»\n\n\
	\t\t\t\t	Мороз снежком укутывал :\n\n\
	\t\t\t\t\t«Смотри, не замерзай!»\n\n\
	\t\t\t\t	Мороз снежком укутывал :\n\n\
	\t\t\t\t\t«Смотри, не замерзай!»\n\n\
	\t\t\t\t	Трусишка зайка серенький\n\n\
	\t\t\t\t	Под ёлочкой скакал.\n\n\
	\t\t\t\t	Порою волк, сердитый волк,\n\n\
	\t\t\t\t	Рысцою пробегал.\n\n\
	\t\t\t\t	Порою волк, сердитый волк,\n\n\
	\t\t\t\t	Рысцою пробегал.\n\n\
	\t\t\t\t	Чу!Снег по лесу частому\n\n\
	\t\t\t\t	Под полозом скрипит.\n\n\
	\t\t\t\t	Лошадка мохноногая\n\n\
	\t\t\t\t	Торопится, бежит.\n\n\
	\t\t\t\t	Везет лошадка дровеньки,\n\n\
	\t\t\t\t	На дровнях мужичёк.\n\n\
	\t\t\t\t	Срубил он нашу ёлочку\n\n\
	\t\t\t\t	Под самый корешок.\n\n\
	\t\t\t\t	Теперь она нарядная,\n\n\
	\t\t\t\t	На праздник к нам пришла.\n\n\
	\t\t\t\t	И много - много радости\n\n\
	\t\t\t\t	Детишкам принесла.\n\n\
	\t\t\t\t	И много - много радости\n\n\
	\t\t\t\t	Детишкам принесла.";
}